"""
1. Создать 3 переменные одного и тоже типа с одинаковыми данными и с одинаковыми идентификаторами.
2. Создать 2 переменные одного и тоже типа с одинаковыми данными и с разными идентификаторами.
3*. Поменять их типы так, чтобы у 1-х трёх стали разные идентификаторы, но при этом остались одинаковые данные
(и одинаковый тип), а у 2-х последних стали одинаковые идентификаторы и остались одинаковые данные (и одинаковый тип).

* добиться нужного результата необходимо только приведением типов данных к нужному
"""

# 1
print('Task 1')
a1 = (15, 11, 'asd')
a2 = (15, 11, 'asd')
a3 = (15, 11, 'asd')
print(f'a1: {a1}, ; {type(a1)},  {id(a1)}')
print(f'a2: {a2}, ; {type(a2)},  {id(a2)}')
print(f'a3: {a3}, ; {type(a3)},  {id(a3)}')
print(f'a1 == a2: {a1 == a2}        a1 is a2: {a1 is a2}')
print(f'a1 == a3: {a1 == a3}        a1 is a3: {a1 is a3}')
print(f'a3 == a2: {a3 == a2}        a3 is a2: {a3 is a2}')
# 3a
print('-' * 50)
print('Task 3_a')
a1 = tuple(list(a1))
a2 = tuple(list(a2))
a3 = a3[0:]
print(f'a1: {a1}, ; {type(a1)},  {id(a1)}')
print(f'a2: {a2}, ; {type(a2)},  {id(a2)}')
print(f'a3: {a3}, ; {type(a3)},  {id(a3)}')
print(f'a1 == a2: {a1 == a2}        a1 is a2: {a1 is a2}')
print(f'a1 == a3: {a1 == a3}        a1 is a3: {a1 is a3}')
print(f'a3 == a2: {a3 == a2}        a3 is a2: {a3 is a2}')
# 2
print('-' * 50)
print('Task 2')
b1 = ['Ky']
b2 = ['Ky']
print(f'b1: {b1}, ; {type(b1)},  {id(b1)}')
print(f'b2: {b2}, ; {type(b2)},  {id(b2)}')
print(f'b1 == b2: {b1 == b2}        b1 is b2: {b1 is b2}')
# 3b
print('-' * 50)
print('Task 3_b')
b1 = str(b1[0])
b2 = str(b2[0])
print(f'b1: {b1}, ; {type(b1)},  {id(b1)}')
print(f'b2: {b2}, ; {type(b2)},  {id(b2)}')
print(f'b1 == b2: {b1 == b2}        b1 is b2: {b1 is b2}')
